clear, clc;
 
%1. Ввод с клавиатуры векторов и матриц.
v=input('v=');
w=input('w=');
m=input('m=');
 
%2. Генерация матриц специального вида.
m0=zeros(2);
m1=ones(2);
mr=randn(2);
me=eye(2);
 
%3. Вычисление матрицы M по формуле
M=m+mr*me;
 
%4. Изучение функций обработки данных:
[m,n]=size(M); %определение числа строк и столбцов матрицы M;
Max=max(max(M)); %определение максимального элемента матрицы M;
Min=min(min(M)); %определение минимального элемента матрицы M;
S=sum(sum(M)); %суммирование элементов матрицы M;
P=prod(prod(M)); %перемножение элементов матрицы M;

%5. В рабочем окне MATLAB ввести матрицу А
A=[0.8762 0.7726 0.7582 0.8002 0.7962 0.6665 0.9865
0.3556 0.6205 0.9317 0.8679 0.871 0.7559 0.9688
0.906 0.9906 0.9514 0.9894 0.964 0.866 0.8546
0.9792 0.9989 0.9916 0.9457 0.9376 0.9376 0.9182
0.9972 0.9634 0.9278 0.8655 0.9988 0.8666 0.8898
0.9929 0.9995 1 0.9859 0.9325 0.9996 0.4691
0.7826 0.6121 0.9962 0.7631 0.8936 0.9744 0.5783];

%5.1 ...
B=[0.9514 0.9894 0.964 0.866 0.8546
0.9916 0.9457 0.9376 0.9376 0.9182
0.9278 0.8655 0.9988 0.8666 0.8898];

C=[0.8762 0.7726 0.7582 0.8002 0.7962
0.3556 0.6205 0.9317 0.8679 0.871
0.906 0.9906 0.9514 0.9894 0.964];


% 6. Выделить из матрицы А подматрицу В
B1=A(1:3,1:3);

% 7. Умножить матрицу В1* на матрицу С с точкой и без точки
disp(B1*C)
C=C(1:3,1:3);
disp(B1.*C)

% 8. Разделить матрицу В1 на матрицу A левым делением с точкой и без точки.
disp(B1.\B1)
disp(B1\B1)

% 9. Транспонировать матрицу A.
ctranspose(A)

